In [1]:
import pandas as pd
a1 = [1, "송준기", 680]
b1 = [1, "권보아", 880]
c1 = [2, "김나현", 620]
d1 = [2, "송준기", 750]
e1 = [3, "김나현", 750]
f1 = [3, "박효신", 920]
g1 = [3, "진달래", 850]
df1 = pd.DataFrame([a1, a1, b1, c1, d1, e1, f1, g1], columns=["회차", "이름", "점수"])

df.duplicated([열1,열2,,,열n], keep="first" or "last" or False)

In [3]:
df1.duplicated() # 중복값 존재여부 체크

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7    False
dtype: bool

In [4]:
df1.drop_duplicates() # 중복값을 처음값만 두고 삭제한다.

   회차   이름   점수
0   1  송준기  680
2   1  권보아  880
3   2  김나현  620
4   2  송준기  750
5   3  김나현  750
6   3  박효신  920
7   3  진달래  850

In [5]:
df1.drop_duplicates("이름")

   회차   이름   점수
0   1  송준기  680
2   1  권보아  880
3   2  김나현  620
6   3  박효신  920
7   3  진달래  850

In [6]:
df1.drop_duplicates("이름", keep="last") # 중복값을 마지막 값을 두고 삭제한다. "first"가 디폴트 값

   회차   이름   점수
2   1  권보아  880
4   2  송준기  750
5   3  김나현  750
6   3  박효신  920
7   3  진달래  850

In [7]:
df1.drop_duplicates("이름", keep=False) # 중복값이 모두 삭제한다. (시험을 1번만 본 사람만 추출할 때)

   회차   이름   점수
2   1  권보아  880
6   3  박효신  920
7   3  진달래  850